Revit 2027 API
BuiltInFailures.CurtainGridFamilyFailures.CurtainPanelNotBelongsToElement Property
 Curtain element Panel doesn't belong to Curtain element. In merging, you must select the version of a Curtain element that has had Panels added to it.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CurtainPanelNotBelongsToElement { get; }
Public Shared ReadOnly Property CurtainPanelNotBelongsToElement As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CurtainPanelNotBelongsToElement {
	FailureDefinitionId^ get ();
}
static member CurtainPanelNotBelongsToElement : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainGridFamilyFailures Class
Autodesk.Revit.DB Namespace